{
  "subjects": [
    {
      "name": "الرياضيات",
      "topics": [
        {
          "name": "الجبر",
          "content": [
            "الجبر هو فرع من فروع الرياضيات يتعامل مع الرموز والقواعد لمعالجة هذه الرموز. يستخدم الجبر في حل المعادلات والأنظمة الرياضية. المعادلة الخطية البسيطة لها الشكل ax + b = c حيث a و b و c ثوابت و x هو المتغير.",
            "في الجبر، نتعامل مع العمليات الحسابية على المتغيرات. المتغير هو رمز يمثل قيمة غير معروفة. يمكننا جمع وطرح وضرب وقسمة المتغيرات باستخدام نفس القواعد المستخدمة للأرقام.",
            "المعادلات التربيعية هي معادلات من الدرجة الثانية لها الشكل ax² + bx + c = 0. يمكن حل هذه المعادلات باستخدام القانون العام x = (-b ± √(b² - 4ac)) / 2a.",
            "الدوال الخطية تمثل علاقة خطية بين متغيرين. الصيغة العامة للدالة الخطية هي y = mx + b حيث m هو الميل و b هو نقطة التقاطع مع المحور y.",
            "نظام المعادلات الخطية يتكون من معادلتين أو أكثر يجب حلها معاً. يمكن حل هذه الأنظمة بطرق متعددة مثل الحذف والتعويض والمصفوفات."
          ],
          "difficulty": "medium"
        },
        {
          "name": "الهندسة",
          "content": [
            "الهندسة هي دراسة الأشكال والمساحات والأحجام. تشمل الهندسة المستوية دراسة الأشكال ثنائية الأبعاد مثل المثلثات والمربعات والدوائر.",
            "مساحة المثلث تساوي نصف حاصل ضرب القاعدة في الارتفاع: المساحة = (القاعدة × الارتفاع) / 2. مجموع زوايا أي مثلث يساوي دائماً 180 درجة.",
            "محيط الدائرة يُحسب باستخدام الصيغة C = 2πr حيث r هو نصف القطر. مساحة الدائرة تُحسب باستخدام الصيغة A = πr².",
            "نظرية فيثاغورس تنص على أن مربع الوتر في المثلث القائم الزاوية يساوي مجموع مربعي الضلعين الآخرين: a² + b² = c².",
            "التشابه في المثلثات يعني أن المثلثات لها نفس الشكل لكن قد تختلف في الحجم. الزوايا المتناظرة متساوية والأضلاع المتناظرة متناسبة."
          ],
          "difficulty": "easy"
        },
        {
          "name": "حساب التفاضل والتكامل",
          "content": [
            "حساب التفاضل والتكامل هو فرع من الرياضيات يدرس التغيير المستمر. التفاضل يتعامل مع معدلات التغيير، بينما التكامل يتعامل مع تجميع الكميات.",
            "المشتقة تمثل معدل التغيير اللحظي لدالة. المشتقة الأولى لـ f(x) = x² هي f'(x) = 2x. تُستخدم المشتقات في إيجاد نقاط القيم العظمى والصغرى.",
            "التكامل هو العملية العكسية للتفاضل. التكامل المحدد يحسب المساحة تحت منحنى الدالة بين نقطتين. التكامل غير المحدد يعطي الدالة الأصلية.",
            "قاعدة السلسلة تستخدم لإيجاد مشتقة دالة مركبة. إذا كان h(x) = f(g(x))، فإن h'(x) = f'(g(x)) × g'(x).",
            "النهايات هي المفهوم الأساسي في حساب التفاضل والتكامل. النهاية lim(x→a) f(x) تصف سلوك الدالة f(x) عندما يقترب x من a."
          ],
          "difficulty": "hard"
        }
      ]
    },
    {
      "name": "الفيزياء",
      "topics": [
        {
          "name": "الميكانيكا",
          "content": [
            "الميكانيكا هي فرع الفيزياء الذي يدرس الحركة والقوى. قوانين نيوتن الثلاثة للحركة هي الأساس في الميكانيكا الكلاسيكية.",
            "القانون الأول لنيوتن ينص على أن الجسم يبقى في حالة سكون أو حركة منتظمة في خط مستقيم ما لم تؤثر عليه قوة خارجية.",
            "القانون الثاني لنيوتن ينص على أن القوة تساوي حاصل ضرب الكتلة في التسارع: F = ma. هذا القانون يربط بين القوة والحركة.",
            "القانون الثالث لنيوتن ينص على أن لكل فعل رد فعل مساوٍ له في المقدار ومعاكس له في الاتجاه.",
            "الطاقة الحركية للجسم تُحسب باستخدام الصيغة KE = ½mv² حيث m هي الكتلة و v هي السرعة."
          ],
          "difficulty": "medium"
        },
        {
          "name": "الكهرباء والمغناطيسية",
          "content": [
            "الكهرباء والمغناطيسية ظاهرتان مترابطتان. الشحنة الكهربائية هي خاصية أساسية للمادة. هناك نوعان من الشحنات: موجبة وسالبة.",
            "قانون كولوم يصف القوة بين شحنتين كهربائيتين. القوة تتناسب طردياً مع حاصل ضرب الشحنتين وعكسياً مع مربع المسافة بينهما.",
            "التيار الكهربائي هو تدفق الشحنات الكهربائية. يُقاس بالأمبير ويُحسب كمية الشحنة المارة في وحدة الزمن: I = Q/t.",
            "قانون أوم ينص على أن الجهد يساوي حاصل ضرب التيار في المقاومة: V = IR. هذا القانون أساسي في تحليل الدوائر الكهربائية.",
            "المجال المغناطيسي ينتج عن حركة الشحنات الكهربائية. التيار الكهربائي المار في سلك يولد مجالاً مغناطيسياً حوله."
          ],
          "difficulty": "hard"
        },
        {
          "name": "البصريات",
          "content": [
            "البصريات هي دراسة الضوء وسلوكه. الضوء ينتقل في خطوط مستقيمة ويمكن أن ينعكس وينكسر.",
            "قانون الانعكاس ينص على أن زاوية السقوط تساوي زاوية الانعكاس. هذا القانون يفسر كيف نرى الصور في المرايا.",
            "الانكسار هو تغيير اتجاه الضوء عند انتقاله من وسط إلى آخر. قانون سنيل يصف العلاقة بين زوايا السقوط والانكسار.",
            "العدسات هي أجسام شفافة تستخدم لتجميع أو تفريق الضوء. العدسات المحدبة تجمع الضوء بينما العدسات المقعرة تفرقه.",
            "الطيف الكهرومغناطيسي يشمل جميع أنواع الإشعاع الكهرومغناطيسي من موجات الراديو إلى أشعة جاما. الضوء المرئي جزء صغير من هذا الطيف."
          ],
          "difficulty": "easy"
        }
      ]
    },
    {
      "name": "الكيمياء",
      "topics": [
        {
          "name": "الكيمياء العضوية",
          "content": [
            "الكيمياء العضوية هي دراسة مركبات الكربون. الكربون فريد في قدرته على تكوين سلاسل وحلقات طويلة ومعقدة.",
            "الهيدروكربونات هي مركبات تتكون من الكربون والهيدروجين فقط. تشمل الألكانات والألكينات والألكاينات حسب نوع الرابطة.",
            "المجموعات الوظيفية هي ذرات أو مجموعات من الذرات تعطي المركب العضوي خصائصه المميزة. تشمل الكحولات والألدهيدات والكيتونات.",
            "التفاعلات العضوية تشمل تفاعلات الإضافة والحذف والاستبدال. هذه التفاعلات أساسية في تصنيع المركبات العضوية.",
            "البوليمرات هي جزيئات كبيرة تتكون من وحدات متكررة تسمى المونومرات. البلاستيك والمطاط أمثلة على البوليمرات الصناعية."
          ],
          "difficulty": "hard"
        },
        {
          "name": "الكيمياء غير العضوية",
          "content": [
            "الكيمياء غير العضوية تدرس جميع العناصر والمركبات ما عدا معظم مركبات الكربون. تشمل المعادن واللا معادن وأملاحها.",
            "الجدول الدوري ينظم العناصر حسب عددها الذري وخواصها الكيميائية. العناصر في نفس المجموعة لها خواص متشابهة.",
            "الروابط الأيونية تتكون بين المعادن واللا معادن من خلال انتقال الإلكترونات. الروابط التساهمية تتكون من خلال مشاركة الإلكترونات.",
            "الأحماض هي مواد تعطي أيونات الهيدروجين H+ في المحلول. القواعد هي مواد تعطي أيونات الهيدروكسيد OH-.",
            "تفاعلات الأكسدة والاختزال تتضمن انتقال الإلكترونات بين المواد. الأكسدة هي فقدان الإلكترونات والاختزال هو اكتسابها."
          ],
          "difficulty": "medium"
        },
        {
          "name": "الكيمياء الفيزيائية",
          "content": [
            "الكيمياء الفيزيائية تدرس الخواص الفيزيائية للمواد وعلاقتها بالتركيب الكيميائي. تجمع بين الكيمياء والفيزياء.",
            "الديناميكا الحرارية الكيميائية تدرس الطاقة في التفاعلات الكيميائية. التفاعلات الطاردة للحرارة تطلق طاقة والماصة للحرارة تمتصها.",
            "سرعة التفاعل تعتمد على عدة عوامل منها التركيز ودرجة الحرارة والحفز. الحفازات تزيد سرعة التفاعل دون أن تستهلك.",
            "الاتزان الكيميائي يحدث عندما تتساوى سرعة التفاعل الأمامي والعكسي. ثابت الاتزان K يصف نسبة تركيزات المواد عند الاتزان.",
            "الكيمياء الكهربائية تدرس العلاقة بين الكهرباء والتفاعلات الكيميائية. الخلايا الجلفانية تحول الطاقة الكيميائية إلى كهربائية."
          ],
          "difficulty": "hard"
        }
      ]
    },
    {
      "name": "الأحياء",
      "topics": [
        {
          "name": "علم الخلية",
          "content": [
            "الخلية هي الوحدة الأساسية للحياة. جميع الكائنات الحية تتكون من خلية واحدة أو أكثر. الخلايا تقوم بجميع وظائف الحياة الأساسية.",
            "النواة هي مركز التحكم في الخلية حيث تخزن المعلومات الوراثية في صورة DNA. الغشاء النووي يحمي المادة الوراثية.",
            "الميتوكوندريا هي مصانع الطاقة في الخلية. تقوم بعملية التنفس الخلوي لإنتاج ATP الذي يمد الخلية بالطاقة.",
            "الريبوسومات هي المسؤولة عن تخليق البروتينات. تقرأ المعلومات من RNA الرسول وتربط الأحماض الأمينية لتكوين البروتين.",
            "الانقسام الخلوي يشمل الانقسام الميتوزي والانقسام الميوزي. الانقسام الميتوزي ينتج خليتين متطابقتين للنمو والإصلاح."
          ],
          "difficulty": "medium"
        },
        {
          "name": "علم الوراثة",
          "content": [
            "علم الوراثة يدرس كيفية انتقال الصفات من الآباء إلى الأبناء. الجينات هي وحدات الوراثة الموجودة على الكروموسومات.",
            "DNA هو الحمض النووي الذي يحمل المعلومات الوراثية. يتكون من شريطين ملتفين يحتويان على قواعد نيتروجينية أربع: A و T و G و C.",
            "قوانين مندل للوراثة تصف كيفية انتقال الصفات. قانون الانعزال ينص على أن كل صفة يحكمها جينان ينفصلان عند تكوين الأمشاج.",
            "الطفرات هي تغيرات في التسلسل الجيني. يمكن أن تكون مفيدة أو ضارة أو محايدة. الطفرات مصدر التنوع الوراثي.",
            "الهندسة الوراثية تتيح تعديل المادة الوراثية للكائنات. تستخدم في الطب والزراعة لإنتاج أدوية ومحاصيل محسنة."
          ],
          "difficulty": "hard"
        },
        {
          "name": "علم البيئة",
          "content": [
            "علم البيئة يدرس العلاقات بين الكائنات الحية وبيئتها. النظام البيئي يشمل الكائنات الحية والعوامل غير الحية.",
            "السلاسل الغذائية تظهر انتقال الطاقة في النظام البيئي. المنتجات كالنباتات تحول طاقة الشمس إلى غذاء والمستهلكات تتغذى عليها.",
            "الدورات البيوجيوكيميائية تصف حركة العناصر في الطبيعة. دورة الماء ودورة الكربون ودورة النيتروجين أمثلة مهمة.",
            "التنوع الحيوي هو تنوع أشكال الحياة على الأرض. حفظ التنوع الحيوي ضروري للحفاظ على استقرار الأنظمة البيئية.",
            "التغير المناخي يؤثر على الأنظمة البيئية في جميع أنحاء العالم. ارتفاع درجات الحرارة وتغير أنماط الأمطار يهدد العديد من الأنواع."
          ],
          "difficulty": "easy"
        }
      ]
    },
    {
      "name": "علوم الحاسوب",
      "topics": [
        {
          "name": "البرمجة",
          "content": [
            "البرمجة هي عملية كتابة تعليمات للحاسوب لأداء مهام محددة. لغات البرمجة مثل Python و Java و JavaScript تستخدم لكتابة البرامج.",
            "المتغيرات هي حاويات لتخزين البيانات في البرنامج. أنواع البيانات الأساسية تشمل الأعداد الصحيحة والأعداد العشرية والنصوص والقيم المنطقية.",
            "الجمل الشرطية تسمح للبرنامج باتخاذ قرارات. جملة if تنفذ كوداً معيناً فقط إذا كان الشرط صحيحاً.",
            "الحلقات تكرر تنفيذ كود معين عدة مرات. حلقة for تكرر عدداً محدداً من المرات بينما while تكرر طالما الشرط صحيح.",
            "الدوال هي كتل من الكود يمكن استدعاؤها عدة مرات. تساعد في تنظيم الكود وإعادة استخدامه وتسهل الصيانة."
          ],
          "difficulty": "easy"
        },
        {
          "name": "هياكل البيانات",
          "content": [
            "هياكل البيانات هي طرق لتنظيم وتخزين البيانات بكفاءة. المصفوفات والقوائم المرتبطة والأشجار والجداول المبعثرة هي أمثلة شائعة.",
            "المصفوفات تخزن عناصر من نفس النوع في مواقع متجاورة في الذاكرة. الوصول إلى أي عنصر يتم في وقت ثابت O(1).",
            "القوائم المرتبطة تتكون من عقد حيث كل عقدة تحتوي على بيانات ومؤشر للعقدة التالية. الإدراج والحذف أسهل من المصفوفات.",
            "المكدسات تتبع نمط LIFO (آخر ما يدخل أول ما يخرج). تستخدم في استدعاء الدوال والتراجع عن العمليات.",
            "الطوابير تتبع نمط FIFO (أول ما يدخل أول ما يخرج). تستخدم في جدولة المهام ومعالجة البيانات بالترتيب."
          ],
          "difficulty": "medium"
        },
        {
          "name": "الخوارزميات",
          "content": [
            "الخوارزميات هي مجموعة من الخطوات المحددة لحل مشكلة معينة. كفاءة الخوارزمية تُقاس بالوقت والمساحة المطلوبين.",
            "البحث الخطي يفحص كل عنصر في القائمة بالتسلسل حتى يجد العنصر المطلوب. التعقيد الزمني هو O(n) حيث n عدد العناصر.",
            "البحث الثنائي يعمل على قوائم مرتبة ويقسم نطاق البحث إلى النصف في كل خطوة. التعقيد الزمني هو O(log n).",
            "خوارزميات الترتيب تنظم البيانات بترتيب معين. الترتيب السريع والترتيب بالدمج من الخوارزميات الفعالة بتعقيد O(n log n).",
            "البرمجة الديناميكية تحل المسائل المعقدة بتقسيمها إلى مسائل فرعية وحفظ النتائج لتجنب الحسابات المكررة."
          ],
          "difficulty": "hard"
        }
      ]
    },
    {
      "name": "اللغة العربية",
      "topics": [
        {
          "name": "النحو",
          "content": [
            "النحو هو علم يدرس أحوال أواخر الكلمات إعراباً وبناءً. الإعراب هو تغيير آخر الكلمة بحسب موقعها في الجملة.",
            "الجملة الاسمية تبدأ باسم وتتكون من مبتدأ وخبر. المبتدأ هو ما ابتدأت به الجملة والخبر هو ما أخبر به عن المبتدأ.",
            "الجملة الفعلية تبدأ بفعل وتتكون من فعل وفاعل ومفعول به إن وجد. الفاعل من قام بالفعل والمفعول به من وقع عليه الفعل.",
            "علامات الإعراب الأصلية هي الضمة للرفع والفتحة للنصب والكسرة للجر والسكون للجزم. هناك علامات فرعية في حالات خاصة.",
            "الأفعال تنقسم إلى ماضٍ ومضارع وأمر. الفعل المضارع المرفوع يدل على الحاضر أو المستقبل ويبدأ بأحد أحرف المضارعة: أ، ن، ي، ت."
          ],
          "difficulty": "medium"
        },
        {
          "name": "البلاغة",
          "content": [
            "البلاغة هي فن استخدام اللغة بطريقة جميلة ومؤثرة. تنقسم إلى علم المعاني والبيان والبديع.",
            "التشبيه هو بيان أن شيئاً شارك غيره في صفة أو أكثر. أركان التشبيه أربعة: المشبه والمشبه به وأداة التشبيه ووجه الشبه.",
            "الاستعارة هي تشبيه حذف أحد طرفيه. الاستعارة المكنية تحذف المشبه به والتصريحية تحذف المشبه.",
            "الكناية هي لفظ يطلق ويراد به لازم معناه مع جواز إرادة المعنى الأصلي. تستخدم للتعبير غير المباشر عن المعنى.",
            "الطباق هو الجمع بين الشيء وضده في الكلام. يضيف جمالاً وقوة للمعنى مثل: الليل والنهار، الحزن والفرح."
          ],
          "difficulty": "hard"
        },
        {
          "name": "الأدب",
          "content": [
            "الأدب العربي من أغنى الآداب العالمية ويمتد عبر قرون طويلة. يشمل الشعر والنثر في مختلف العصور.",
            "الشعر الجاهلي هو شعر العرب قبل الإسلام. يتميز بالقوة والفصاحة ووصف البيئة الصحراوية والمعلقات أشهر قصائده.",
            "العصر الأموي شهد ازدهار الشعر السياسي والغزل. شعراء مثل جرير والفرزدق والأخطل تنافسوا في النقائض.",
            "العصر العباسي عصر ذهبي للأدب العربي. ظهر التجديد في الشعر والنثر وازدهرت الترجمة والعلوم.",
            "الأدب الحديث يجمع بين الأصالة والمعاصرة. ظهرت فنون جديدة كالقصة القصيرة والرواية والمسرح والشعر الحر."
          ],
          "difficulty": "easy"
        }
      ]
    },
    {
      "name": "التاريخ",
      "topics": [
        {
          "name": "التاريخ الإسلامي",
          "content": [
            "التاريخ الإسلامي يبدأ ببعثة النبي محمد صلى الله عليه وسلم في مكة عام 610 ميلادية. انتشر الإسلام بسرعة في شبه الجزيرة العربية.",
            "الخلافة الراشدة استمرت ثلاثين عاماً بعد وفاة النبي. الخلفاء الراشدون الأربعة: أبو بكر وعمر وعثمان وعلي رضي الله عنهم.",
            "الدولة الأموية أسسها معاوية بن أبي سفيان عام 661م. امتدت من الصين شرقاً إلى فرنسا غرباً واتخذت دمشق عاصمة.",
            "الدولة العباسية قامت عام 750م واستمرت حتى 1258م. كان عصرها الذهبي في عهد هارون الرشيد والمأمون.",
            "الدولة العثمانية كانت آخر الخلافات الإسلامية الكبرى. استمرت من 1299 إلى 1922م وفتحت القسطنطينية عام 1453م."
          ],
          "difficulty": "medium"
        },
        {
          "name": "التاريخ الحديث",
          "content": [
            "الثورة الصناعية بدأت في بريطانيا في القرن الثامن عشر. غيرت طريقة إنتاج السلع من الصناعة اليدوية إلى الآلية.",
            "الحرب العالمية الأولى (1914-1918) كانت صراعاً عالمياً شمل معظم دول أوروبا. أدت إلى انهيار عدة إمبراطوريات.",
            "الحرب العالمية الثانية (1939-1945) كانت الأكثر دموية في التاريخ. بدأت بغزو ألمانيا لبولندا وانتهت بهزيمة المحور.",
            "الحرب الباردة كانت توتراً بين المعسكرين الشرقي بقيادة الاتحاد السوفييتي والغربي بقيادة أمريكا بعد الحرب العالمية الثانية.",
            "سقوط جدار برلين عام 1989 رمز لنهاية الحرب الباردة. أدى إلى انهيار الاتحاد السوفييتي وتوحيد ألمانيا."
          ],
          "difficulty": "easy"
        },
        {
          "name": "الحضارات القديمة",
          "content": [
            "الحضارة المصرية القديمة من أقدم الحضارات في العالم. اشتهرت بالأهرامات والمعابد والكتابة الهيروغليفية.",
            "الحضارة اليونانية أسست مبادئ الديمقراطية والفلسفة. فلاسفة مثل سقراط وأفلاطون وأرسطو أثروا في الفكر الإنساني.",
            "الإمبراطورية الرومانية سيطرت على حوض البحر المتوسط. نشرت القانون الروماني وبنت شبكة طرق واسعة.",
            "حضارة بلاد الرافدين في العراق القديم طورت الكتابة المسمارية. السومريون والبابليون والآشوريون من شعوبها.",
            "حضارة وادي السند في باكستان والهند كانت متقدمة في التخطيط العمراني. مدن مثل موهنجو دارو وهارابا شهيرة بتنظيمها."
          ],
          "difficulty": "hard"
        }
      ]
    },
    {
      "name": "الجغرافيا",
      "topics": [
        {
          "name": "الجغرافيا الطبيعية",
          "content": [
            "الجغرافيا الطبيعية تدرس المظاهر الطبيعية على سطح الأرض. تشمل التضاريس والمناخ والتربة والنبات الطبيعي.",
            "الجبال تتشكل بفعل القوى التكتونية والبراكين. سلاسل جبلية مثل الهيمالايا والألب والأنديز من أعلى الجبال في العالم.",
            "الأنهار تنحت الأودية وتنقل الرواسب. نهر النيل أطول أنهار العالم والأمازون أكبرها من حيث حجم الماء.",
            "المناخ يختلف حسب خطوط العرض والارتفاع والقرب من المسطحات المائية. المناخ الاستوائي حار رطب والقطبي بارد جاف.",
            "التصحر هو تدهور الأراضي في المناطق الجافة. يحدث بسبب تغير المناخ والاستخدام السيئ للأراضي."
          ],
          "difficulty": "easy"
        },
        {
          "name": "الجغرافيا البشرية",
          "content": [
            "الجغرافيا البشرية تدرس توزيع السكان وأنشطتهم. تشمل الجغرافيا السكانية والحضرية والاقتصادية.",
            "الكثافة السكانية تقاس بعدد السكان لكل كيلومتر مربع. المناطق الساحلية والأودية النهرية عادة أكثر كثافة.",
            "التحضر هو انتقال السكان من الريف إلى المدن. يزداد معدل التحضر في الدول النامية بسبب البحث عن فرص أفضل.",
            "الزراعة المكثفة تنتج محاصيل كبيرة من مساحات صغيرة باستخدام التكنولوجيا. الزراعة الواسعة تستخدم مساحات كبيرة بإنتاج أقل للهكتار.",
            "العولمة زادت من الترابط الاقتصادي والثقافي بين دول العالم. سهلت التجارة والاتصالات ولكن خلقت تحديات أيضاً."
          ],
          "difficulty": "medium"
        },
        {
          "name": "الخرائط",
          "content": [
            "الخرائط هي تمثيلات مصغرة لسطح الأرض أو جزء منه. تستخدم رموزاً وألواناً لإظهار المعلومات الجغرافية.",
            "خطوط الطول تمتد من القطب الشمالي إلى الجنوبي. خط غرينتش هو خط الطول الرئيسي وقيمته صفر درجة.",
            "خطوط العرض دوائر موازية لخط الاستواء. خط الاستواء هو خط العرض الرئيسي وقيمته صفر درجة.",
            "المقياس يوضح العلاقة بين المسافات على الخريطة والواقع. المقياس الكبير يظهر تفاصيل أكثر لمنطقة صغيرة.",
            "نظم المعلومات الجغرافية GIS تستخدم الحاسوب لتخزين وتحليل وعرض البيانات الجغرافية. تستخدم في التخطيط وإدارة الموارد."
          ],
          "difficulty": "medium"
        }
      ]
    },
    {
      "name": "الاقتصاد",
      "topics": [
        {
          "name": "الاقتصاد الجزئي",
          "content": [
            "الاقتصاد الجزئي يدرس سلوك الأفراد والشركات في اتخاذ القرارات الاقتصادية. يركز على الأسواق الفردية والأسعار.",
            "العرض والطلب هما القوتان الأساسيتان في السوق. العرض هو كمية السلعة المعروضة والطلب هو كمية السلعة المطلوبة.",
            "سعر التوازن يتحقق عندما تتساوى الكمية المعروضة مع الكمية المطلوبة. عنده لا يوجد فائض ولا نقص في السلعة.",
            "المرونة السعرية للطلب تقيس حساسية الكمية المطلوبة للتغير في السعر. الطلب المرن يتغير كثيراً مع السعر.",
            "المنافسة الكاملة نموذج سوق فيه عدد كبير من البائعين والمشترين. لا أحد يستطيع التأثير على السعر منفرداً."
          ],
          "difficulty": "medium"
        },
        {
          "name": "الاقتصاد الكلي",
          "content": [
            "الاقتصاد الكلي يدرس الاقتصاد ككل. يركز على المتغيرات الكلية مثل الناتج المحلي الإجمالي والتضخم والبطالة.",
            "الناتج المحلي الإجمالي GDP هو قيمة جميع السلع والخدمات النهائية المنتجة في بلد خلال فترة زمنية معينة.",
            "التضخم هو ارتفاع مستمر في المستوى العام للأسعار. يقلل من القوة الشرائية للنقود ويؤثر على الادخار والاستثمار.",
            "البطالة هي نسبة القوى العاملة القادرة والراغبة في العمل لكن لا تجد عملاً. أنواعها: احتكاكية وهيكلية ودورية.",
            "السياسة النقدية تستخدمها البنوك المركزية للتحكم في عرض النقود وأسعار الفائدة. تؤثر على التضخم والنمو الاقتصادي."
          ],
          "difficulty": "hard"
        },
        {
          "name": "التجارة الدولية",
          "content": [
            "التجارة الدولية هي تبادل السلع والخدمات عبر الحدود. تسمح للدول بالتخصص في إنتاج ما تجيده وتبادل الفائض.",
            "الميزة النسبية مبدأ يقول إن الدول يجب أن تتخصص في إنتاج السلع التي تنتجها بتكلفة فرصة بديلة أقل.",
            "ميزان المدفوعات يسجل جميع المعاملات الاقتصادية بين بلد والعالم. يشمل ميزان التجارة وميزان رأس المال.",
            "سعر الصرف هو سعر عملة بلد مقابل عملة بلد آخر. يؤثر على القدرة التنافسية للصادرات والواردات.",
            "المنظمات الدولية مثل منظمة التجارة العالمية WTO تعمل على تسهيل التجارة الدولية وحل النزاعات التجارية."
          ],
          "difficulty": "hard"
        }
      ]
    },
    {
      "name": "الفلسفة",
      "topics": [
        {
          "name": "الفلسفة القديمة",
          "content": [
            "الفلسفة اليونانية القديمة وضعت أسس الفكر الفلسفي الغربي. سقراط وأفلاطون وأرسطو من أعظم فلاسفتها.",
            "سقراط استخدم المنهج الحواري للوصول إلى الحقيقة. اشتهر بمقولة 'اعرف نفسك' وحوكم بتهمة إفساد الشباب.",
            "أفلاطون تلميذ سقراط أسس أكاديمية أثينا. نظريته عن المثل تقول إن العالم المحسوس ظل لعالم المثل الحقيقي.",
            "أرسطو تلميذ أفلاطون ومعلم الإسكندر الأكبر. أسس المنطق الصوري وكتب في الفيزياء والبيولوجيا والسياسة.",
            "المدارس الفلسفية الهلنستية مثل الرواقية والأبيقورية ركزت على السعادة والأخلاق في عالم متغير."
          ],
          "difficulty": "hard"
        },
        {
          "name": "الفلسفة الإسلامية",
          "content": [
            "الفلسفة الإسلامية جمعت بين الفلسفة اليونانية والفكر الإسلامي. ازدهرت في العصر الذهبي للحضارة الإسلامية.",
            "الكندي يُعتبر أول فيلسوف عربي مسلم. دافع عن التوافق بين الفلسفة والدين وكتب في الرياضيات والفلك.",
            "الفارابي لُقب بالمعلم الثاني بعد أرسطو. كتب في المنطق والسياسة وحاول التوفيق بين أفلاطون وأرسطو.",
            "ابن سينا أحد أعظم الفلاسفة المسلمين. كتابه القانون في الطب ظل مرجعاً لقرون وفلسفته أثرت في الغرب.",
            "ابن رشد دافع عن الفلسفة ضد منتقديها. شروحاته على أرسطو أثرت كثيراً في الفلسفة الأوروبية في العصور الوسطى."
          ],
          "difficulty": "medium"
        },
        {
          "name": "الفلسفة الحديثة",
          "content": [
            "الفلسفة الحديثة بدأت مع ديكارت في القرن السابع عشر. ركزت على العقل والشك المنهجي كطريق للمعرفة.",
            "ديكارت قال 'أنا أفكر إذاً أنا موجود' كأساس يقيني للمعرفة. أسس الفلسفة العقلانية التي تثق في العقل.",
            "التجريبيون مثل لوك وهيوم قالوا إن المعرفة تأتي من الخبرة الحسية وليس من العقل الفطري.",
            "كانط حاول التوفيق بين العقلانية والتجريبية. قال إن المعرفة تحتاج لكل من العقل والخبرة الحسية.",
            "الوجودية تركز على الوجود الفردي والحرية والاختيار. سارتر قال 'الإنسان محكوم عليه بأن يكون حراً'."
          ],
          "difficulty": "hard"
        }
      ]
    }
  ]
}
